app/controllers/offers_controller.rb

  def show
    @offers = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @offer = Offer.new(offer_params)
    if @offer.save
---
INSERT INTO "offers" ("code", "created_at", "description", "house_rules", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @offer = Offer.find(params[:id])
    if @offer.update_attributes(offer_params)
---
SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "offers" SET "code" = ?, "description" = ?, "house_rules" = ?, "title" = ?, "updated_at" = ? WHERE "offers"."id" = 4  [["code", "codycody"], ["description", "ojsdfpsdfpkadkas;dkas;l"], ["house_rules", "sd;lkas"], ["title", "lah blah"], ["updated_at", "2014-12-30 14:51:53.302808"]]

  def delete
    @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]